In [1]:
import pandas as pd 
import numpy as np
import pandasql as ps

In [2]:
employee = pd.read_excel("C:\\Practice_Dhruv\\employee_sample.xlsx")

In [3]:
employee.columns

Index(['employ_id', 'first_name', 'last_name', 'email', 'phone_number',
       'hire_date', 'job_id', 'salary', 'commission_pct', 'manager_id',
       'department_id'],
      dtype='object')

In [4]:
first_name = ps.sqldf('''select first_name from employee''')

In [5]:
first_name

    first_name
0       Steven
1        Neena
2          Lex
3    Alexander
4        Bruce
..         ...
102        Pat
103      Susan
104    Hermann
105    Shelley
106    William

[107 rows x 1 columns]

In [6]:
max_salary = ps.sqldf('''select max(salary) as 'MAXIMUM SALARY' from employee''')

In [7]:
max_salary

   MAXIMUM SALARY
0           24000

In [9]:
print(ps.sqldf('''select first_name from employee where salary = 24000'''))

  first_name
0     Steven

In [11]:
print(ps.sqldf('''select * from first_name a,first_name b'''))

      first_name first_name
0         Steven     Steven
1         Steven      Neena
2         Steven        Lex
3         Steven  Alexander
4         Steven      Bruce
...          ...        ...
11444    William        Pat
11445    William      Susan
11446    William    Hermann
11447    William    Shelley
11448    William    William

[11449 rows x 2 columns]

In [12]:
107*107

11449